{"2105.15035": {"title": "Machine Learning for Security in Vehicular Networks: A Comprehensive Survey", "authors": "Anum Talpur, Mohan Gurusamy", "publication": "Submitted in IEEE Communications Surveys & Tutorials", "year": "2021"}, "2105.13114": {"title": "RL-GRIT: Reinforcement Learning for Grammar Inference", "authors": "Walt Woods", "publication": "13 pages, published at IEEE LangSec 2021 (https://langsec.org/spw21/papers.html). ArXiv version: lacking correct 'minted' package behavior, so some atoms may look a little off", "year": "2021"}, "2105.08955": {"title": "QUAC-TRNG: High-Throughput True Random Number Generation Using Quadruple Row Activation in Commodity DRAM Chips", "authors": "Ataberk Olgun, Minesh Patel, A. Giray Yağlıkçı, Haocong Luo, Jeremie S. Kim, Nisa Bostancı, Nandita Vijaykumar, Oğuz Ergin, Onur Mutlu", "publication": "15 pages, 14 figures. A shorter version of this work is to appear at the 48th IEEE International Symposium on Computer Architecture (ISCA 2021)", "year": "2021"}, "2105.08350": {"title": "Generic Reversible Visible Watermarking Via Regularized Graph Fourier Transform Coding", "authors": "Wenfa Qi, Wei Hu, Sirui Guo, Zongming Guo, Xiang Wang", "publication": "This manuscript is submitted to IEEE Transactions on Image Processing on May 17th 2021. It has 13 pages, 10 figures and 3 tables", "year": "2021"}, "2105.06381": {"title": "Class-Incremental Learning for Wireless Device Identification in IoT", "authors": "Yongxin Liu, Jian Wang, Jianqiang Li, Shuteng Niu, Houbing Song", "publication": "Accepted for publication by IEEE Internet of Things Journal", "year": "2021"}, "2105.05717": {"title": "An Efficient Learning Framework For Federated XGBoost Using Secret Sharing And Distributed Optimization", "authors": "Lunchen Xie, Jiaqi Liu, Songtao Lu, Tsung-hui Chang, Qingjiang Shi", "publication": "24 pages, Special issue of ACM Transactions on Intelligent Systems and Technology", "year": "2021"}, "2105.03642": {"title": "MIMO Terahertz Quantum Key Distribution", "authors": "Neel Kanth Kundu, Soumya P. Dash, Matthew R. McKay, Ranjan K. Mallik", "publication": "Submitted to IEEE Communications Letters", "year": "2021"}, "2105.03346": {"title": "Detecting Security Fixes in Open-Source Repositories using Static Code Analyzers", "authors": "Therese Fehrer, Rocío Cabrera Lozoya, Antonino Sabetta, Dario Di Nucci, Damian A. Tamburri", "publication": "Submitted to ESEC/FSE 2021, Industry Track", "year": "2021"}, "2105.01350": {"title": "Effects of Quantization on the Multiple-Round Secret-Key Capacity", "authors": "Onur Günlü, Ueli Maurer, João Ribeiro", "publication": "Submitted to IEEE", "year": "2021"}, "2105.00770": {"title": "Channels of Small Log-Ratio Leakage and Characterization of Two-Party Differentially Private Computation", "authors": "Iftach Haitner, Noam Mazor, Ronen Shaltiel, Jad Silbak", "publication": "A preliminary version appeared in TCC 2019", "year": "2021"}, "2105.00761": {"title": "Lower Bounds on the Time/Memory Tradeoff of Function Inversion", "authors": "Dror Chawin, Iftach Haitner, Noam Mazor", "publication": "A preliminary version appeared in TCC 2020", "year": "2021"}, "2105.00529": {"title": "GRNN: Generative Regression Neural Network -- A Data Leakage Attack for Federated Learning", "authors": "Hanchi Ren, Jingjing Deng, Xianghua Xie", "publication": "Submitted to ACM Transactions on Intelligent Systems and Technology. For associated source file, see https://github.com/Rand2AI/GRNN", "year": "2021"}, "2104.11691": {"title": "Patch Shortcuts: Interpretable Proxy Models Efficiently Find Black-Box Vulnerabilities", "authors": "Julia Rosenzweig, Joachim Sicking, Sebastian Houben, Michael Mock, Maram Akila", "publication": "Under IEEE Copyright; accepted at the SAIAD (Safe Artificial Intelligence for Automated Driving) Workshop at CVPR 2021", "year": "2021"}, "2104.09898": {"title": "Market Value of Differentially-Private Smart Meter Data", "authors": "Saurab Chhachhi, Fei Teng", "publication": "5 pages, 4 figures, submitted to the 2021 IEEE Power & Energy Society Innovative Smart Grid Technologies Conference (ISGT NA)", "year": "2021"}, "2104.04572": {"title": "Smart and Secure CAV Networks Empowered by AI-Enabled Blockchain: Next Frontier for Intelligent Safe-Driving Assessment", "authors": "Le Xia, Yao Sun, Rafiq Swash, Lina Mohjazi, Lei Zhang, Muhammad Ali Imran", "publication": "8 pages, 4 figures, 1 table, this paper has been submitted to IEEE Wireless Communications Magazine and is still awaiting the review result", "year": "2021"}, "2104.03354": {"title": "Prism: Private Verifiable Set Computation over Multi-Owner Outsourced Databases", "authors": "Yin Li, Dhrubajyoti Ghosh, Peeyush Gupta, Sharad Mehrotra, Nisha Panwar, Shantanu Sharma", "publication": "This paper has been accepted in ACM SIGMOD 2021", "year": "2021"}, "2104.03277": {"title": "Decentralized Cross-Network Identity Management for Blockchain Interoperation", "authors": "Bishakh Chandra Ghosh, Venkatraman Ramakrishna, Chander Govindarajan, Dushyant Behl, Dileban Karunamoorthy, Ermyas Abebe, Sandip Chakraborty", "publication": "9 pages, 5 figures, accepted for publication in the proceedings of the IEEE International Conference on Blockchain and Cryptocurrency (ICBC) 2021", "year": "2021"}, "2103.17122": {"title": "Adversarial Attacks and Defenses for Speech Recognition Systems", "authors": "Piotr Żelasko, Sonal Joshi, Yiwen Shao, Jesus Villalba, Jan Trmal, Najim Dehak, Sanjeev Khudanpur", "publication": "This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible", "year": "2021"}, "2103.14835": {"title": "LiBRe: A Practical Bayesian Approach to Adversarial Detection", "authors": "Zhijie Deng, Xiao Yang, Shizhen Xu, Hang Su, Jun Zhu", "publication": "IEEE/ CVF International Conference on Computer Vision and Pattern Recognition (CVPR), 2021", "year": "2021"}, "2103.14056": {"title": "Reinforcement Learning for Deceiving Reactive Jammers in Wireless Networks", "authors": "Ali Pourranjbar, Georges Kaddoum, Aidin Ferdowsi, Walid Saad", "publication": "in IEEE Transactions on Communications", "year": "2021"}, "2103.11518": {"title": "An Empirical Study of OSS-Fuzz Bugs", "authors": "Zhen Yu Ding, Claire Le Goues", "publication": "12 pages; accepted at the 2021 IEEE/ACM 18th International Conference on Mining Software Repositories (MSR)", "year": "2021"}, "2103.11109": {"title": "DataLens: Scalable Privacy Preserving Training via Gradient Compression and Aggregation", "authors": "Boxin Wang, Fan Wu, Yunhui Long, Luka Rimanic, Ce Zhang, Bo Li", "publication": "Accepted to ACM CCS 2021. 25 pages, 4 figures, 13 tables", "year": "2021"}, "2103.07934": {"title": "Quantum and Randomised Algorithms for Non-linearity Estimation", "authors": "Debajyoti Bera, Tharrmashastha Sapv", "publication": "Accepted in ACM Transactions on Quantum Computing", "year": "2021"}, "2103.07101": {"title": "On the (In)Feasibility of Attribute Inference Attacks on Machine Learning Models", "authors": "Benjamin Zi Hao Zhao, Aviral Agrawal, Catisha Coburn, Hassan Jameel Asghar, Raghav Bhaskar, Mohamed Ali Kaafar, Darren Webb, Peter Dickinson", "publication": "20 pages, accepted at IEEE EuroS&P 2021", "year": "2021"}, "2103.05633": {"title": "Proof-of-Learning: Definitions and Practice", "authors": "Hengrui Jia, Mohammad Yaghini, Christopher A. Choquette-Choo, Natalie Dullerud, Anvith Thudi, Varun Chandrasekaran, Nicolas Papernot", "publication": "To appear in the 42nd IEEE Symposium on Security and Privacy", "year": "2021"}, "2102.08308": {"title": "Active Privacy-utility Trade-off Against a Hypothesis Testing Adversary", "authors": "Ecenaz Erdemir, Pier Luigi Dragotti, Deniz Gunduz", "publication": "Accepted to IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP 2021)", "year": "2021"}, "2102.06254": {"title": "Securing RPL using Network Coding: The Chained Secure Mode (CSM)", "authors": "Ahmed Raoof, Chung-Horng Lung, Ashraf Matrawy", "publication": "10 pages, 20 figures, 2 tables, Submitted to IEEE IoT Journal for review. This is an significantly extended version of arXiv:2006.00310 which was published in NCA 2020 (available at IEEExplore)", "year": "2021"}, "2102.04737": {"title": "Federated Learning with Local Differential Privacy: Trade-offs between Privacy, Utility, and Communication", "authors": "Muah Kim, Onur Günlü, Rafael F. Schaefer", "publication": "To appear in IEEE International Conference on Acoustics, Speech, and Signal Processing 2021", "year": "2021"}, "2102.03722": {"title": "Object Removal Attacks on LiDAR-based 3D Object Detectors", "authors": "Zhongyuan Hau, Kenneth T. Co, Soteris Demetriou, Emil C. Lupu", "publication": "Accepted to AutoSec at NDSS 2021", "year": "2021"}, "2101.10570": {"title": "Towards a Secure and Resilient All-Renewable Energy Grid for Smart Cities", "authors": "Charalambos Konstantinou", "publication": "Accepted to IEEE Consumer Electronics Magazine", "year": "2021"}, "2101.09712": {"title": "Quantum Learning Based Nonrandom Superimposed Coding for Secure Wireless Access in 5G URLLC", "authors": "Dongyang Xu, Pinyi Ren", "publication": "Accepted by IEEE TIFS", "year": "2021"}, "2101.09378": {"title": "Ants-Review: a Protocol for Incentivized Open Peer-Reviews on Ethereum", "authors": "Bianca Trovò, Nazzareno Massari", "publication": "8 pages, 1 figure, to appear as \"B. Trovò, N. Massari (forthcoming). Ants-Review: a Protocol for Incentivized Open Peer-Reviews on Ethereum. In: Bartosz Balis, Dora B. Heras et al. (eds) Euro-Par 2020: Parallel Processing Workshops. Euro-Par 2020. Lecture Notes in Computer Science, Springer, Cham.\"", "year": "2021"}, "2101.07981": {"title": "Inference under Information Constraints III: Local Privacy Constraints", "authors": "Jayadev Acharya, Clément L. Canonne, Cody Freitag, Ziteng Sun, Himanshu Tyagi", "publication": "To appear in the Special Issue on Privacy and Security of Information Systems of the IEEE Journal on Selected Areas in Information Theory (JSAIT), 2021. Journal version of the AISTATS'19 paper \"Test without Trust: Optimal Locally Private Distribution Testing\" (arXiv:1808.02174), which it extends and supersedes", "year": "2021"}, "2101.06565": {"title": "Joint Beamforming and Location Optimization for Secure Data Collection in Wireless Sensor Networks with UAV-Carried Intelligent Reflecting Surface", "authors": "Christantus O. Nnamani, Muhammad R. A. Khandaker, Mathini Sellathurai", "publication": "Submitted to IEEE Transactions on Communications", "year": "2021"}, "2101.04427": {"title": "Quantum Internet- Applications, Functionalities, Enabling Technologies, Challenges, and Research Directions", "authors": "Amoldeep Singh, Kapal Dev, Harun Siljak, Hem Dutt Joshi, Maurizio Magarini", "publication": "This survey paper is submitted in IEEE Communications Surveys and Tutorials. It includes 29 pages and 11 figures", "year": "2021"}, "2101.01032": {"title": "Local Black-box Adversarial Attacks: A Query Efficient Approach", "authors": "Tao Xiang, Hangcheng Liu, Shangwei Guo, Tianwei Zhang, Xiaofeng Liao", "publication": "This work has been submitted to the IEEE for possible publication", "year": "2021"}, "2012.15041": {"title": "Damaged Fingerprint Recognition by Convolutional Long Short-Term Memory Networks for Forensic Purposes", "authors": "Jaouhar Fattahi, Mohamed Mejri", "publication": "This paper was accepted, on December 5, 2020, for publication and oral presentation at the 2021 IEEE 5th International Conference on Cryptography, Security and Privacy (CSP 2021) to be held in Zhuhai, China during January 8-10, 2021 and hosted by Beijing Normal University (Zhuhai)", "year": "2020"}, "2012.13028": {"title": "General Domain Adaptation Through Proportional Progressive Pseudo Labeling", "authors": "Mohammad J. Hashemi, Eric Keller", "publication": "Published at 2020 IEEE International Conference on Big Data (Big Data)", "year": "2020"}, "2012.11354": {"title": "Unsupervised Anomaly Detectors to Detect Intrusions in the Current Threat Landscape", "authors": "Tommaso Zoppi, Andrea ceccarelli, Tommaso Capecchi, Andrea Bondavalli", "publication": "Will be published on ACM Transactions Data Science", "year": "2020"}, "2012.10431": {"title": "TILT: A GDPR-Aligned Transparency Information Language and Toolkit for Practical Privacy Engineering", "authors": "Elias Grünewald, Frank Pallas", "publication": "Accepted for publication at the ACM Conference on Fairness, Accountability, and Transparency 2021 (ACM FAccT'21). This is a preprint manuscript (authors' own version before final copy-editing)", "year": "2020"}, "2012.08980": {"title": "Secure Degrees-of-Freedom of the MIMO X Channel with Delayed CSIT", "authors": "Tong Zhang, Rui Wang", "publication": "Accepted by IEEE WCL", "year": "2020"}, "2012.04156": {"title": "An Efficient Analyses of the Behavior of One Dimensional Chaotic Maps using 0-1 Test and Three State Test", "authors": "Joan S. Muthu, Aditya Jyoti Paul, P. Murali", "publication": "6 pages, Published in IEEE RAICS 2020, see https://www.raics.in", "year": "2020"}, "2011.14818": {"title": "Advancements of federated learning towards privacy preservation: from federated learning to split learning", "authors": "Chandra Thapa, M. A. P. Chamikara, Seyit A. Camtepe", "publication": "Authors' preprint version (before any peer-review) of a book chapter to appear in the Book series \"Studies in Computational Intelligence\", Book title \"Federated Learning Systems: Towards Next-generation AI\", Book eds. Muhammad Habib ur Rehman and Mohamed Medhat Gaber, Publisher \"Springer Nature Switzerland AG Gewerbestrasse 11, 6330 Cham, Switzerland.\"", "year": "2020"}, "2011.11819": {"title": "When Machine Learning Meets Privacy: A Survey and Outlook", "authors": "Bo Liu, Ming Ding, Sina Shaham, Wenny Rahayu, Farhad Farokhi, Zihuai Lin", "publication": "This work is accepted by ACM Computing Surveys", "year": "2020"}, "2011.11487": {"title": "Verifying the Correctness of Analytic Query Results", "authors": "Masoud Nosrati, Ying Cai", "publication": "IEEE Transactions on Knowledge and Data Engineering (12 Pages)", "year": "2020"}, "2011.09982": {"title": "On the Feasibility of Load-Changing Attacks in Power Systems during the COVID-19 Pandemic", "authors": "Juan Ospina, XiaoRui Liu, Charalambos Konstantinou, Yury Dvorkin", "publication": "Accepted version of IEEE Access paper published under the Open Access Publishing agreement. 19 pages, 17 figures, 3 tables", "year": "2020"}, "2011.07269": {"title": "Software Protection as a Risk Analysis Process", "authors": "Daniele Canavese, Leonardo Regano, Cataldo Basile, Bart Coppens, Bjorn De Sutter", "publication": "This paper was submitted to ACM TOPS", "year": "2020"}, "2011.06690": {"title": "Adversarial Robustness Against Image Color Transformation within Parametric Filter Space", "authors": "Zhengyu Zhao, Zhuoran Liu, Martha Larson", "publication": "Code is available at https://github.com/ZhengyuZhao/ACE/tree/master/Journal_version. This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible", "year": "2020"}, "2011.04322": {"title": "An Empirical Evaluation of Bluetooth-based Decentralized Contact Tracing in Crowds", "authors": "Hsu-Chun Hsiao, Chun-Ying Huang, Bing-Kai Hong, Shin-Ming Cheng, Hsin-Yuan Hu, Chia-Chien Wu, Jian-Sin Lee, Shih-Hong Wang, Wei Jeng", "publication": "This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible", "year": "2020"}, "2011.04232": {"title": "SplitEasy: A Practical Approach for Training ML models on Mobile Devices", "authors": "Kamalesh Palanisamy, Vivek Khimani, Moin Hussain Moti, Dimitris Chatzopoulos", "publication": "7 pages, 4 figures, Accepted at the ACM HotMobile workshop", "year": "2020"}}